
## Plan Result




<pre><code>Plan: 5 to add, 9 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_certificate.import_crime_cert
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.trigger_once
* Update
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_certificate.import_crime_cert will be created
  + resource "azurerm_key_vault_certificate" "import_crime_cert" {
      + certificate_attribute   = (known after apply)
      + certificate_data        = (known after apply)
      + certificate_data_base64 = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg"
      + name                    = "hmi-crime-cert-stg"
      + secret_id               = (known after apply)
      + thumbprint              = (known after apply)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
      + versionless_secret_id   = (known after apply)

      + certificate {
          + contents = (sensitive value)
          + password = (sensitive value)
        }

      + certificate_policy {
          + issuer_parameters {
              + name = (known after apply)
            }

          + key_properties {
              + curve      = (known after apply)
              + exportable = (known after apply)
              + key_size   = (known after apply)
              + key_type   = (known after apply)
              + reuse_key  = (known after apply)
            }

          + lifetime_action {
              + action {
                  + action_type = (known after apply)
                }

              + trigger {
                  + days_before_expiry  = (known after apply)
                  + lifetime_percentage = (known after apply)
                }
            }

          + secret_properties {
              + content_type = (known after apply)
            }

          + x509_certificate_properties {
              + extended_key_usage = (known after apply)
              + key_usage          = (known after apply)
              + subject            = (known after apply)
              + validity_in_months = (known after apply)

              + subject_alternative_names {
                  + dns_names = (known after apply)
                  + emails    = (known after apply)
                  + upns      = (known after apply)
                }
            }
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.schedule will be created
  + resource "azurerm_automation_job_schedule" "schedule" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "false"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rl"
          + "remaining_days"       = "60"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rl"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rl"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.trigger_once will be created
  + resource "azurerm_automation_job_schedule" "trigger_once" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "false"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rl"
          + "remaining_days"       = "60"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rl"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rl"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
      ~ start_time              = "2023-09-19T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
      ~ start_time              = "2023-09-18T08:43:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_job_schedule.schedule will be created
  + resource "azurerm_automation_job_schedule" "schedule" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "false"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rlw"
          + "remaining_days"       = "60"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rlw"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rlw"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_job_schedule.trigger_once will be created
  + resource "azurerm_automation_job_schedule" "trigger_once" {
      + automation_account_name = "hmi-stg-aa"
      + id                      = (known after apply)
      + job_schedule_id         = (known after apply)
      + parameters              = {
          + "blob_name"            = ""
          + "bypass_akv_network"   = "false"
          + "container_name"       = "rota"
          + "environment"          = "stg"
          + "expiry_days"          = "240"
          + "key_vault_name"       = "hmi-kv-stg-shared-rota"
          + "permissions"          = "rlw"
          + "remaining_days"       = "60"
          + "resource_group_name"  = "hmi-sharedinfra-stg-rg"
          + "secret_name"          = "rota-sas-rota-rlw"
          + "storage_account_name" = "hmisastg"
          + "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759"
        }
      + resource_group_name     = "hmi-sharedinfra-stg-rg"
      + runbook_name            = "rotate-sas-tokens-hmisastg-rota-rlw"
      + schedule_name           = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
      ~ start_time              = "2023-09-19T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
      ~ start_time              = "2023-09-18T08:43:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg-shared-cft|hmi-kv-stg-shared-cft"
        name                           = "hmi-kv-stg-shared-cft"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg-shared-crime|hmi-kv-stg-shared-crime"
        name                           = "hmi-kv-stg-shared-crime"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg|hmi-kv-stg"
        name                           = "hmi-kv-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg-shared-rota|hmi-kv-stg-shared-rota"
        name                           = "hmi-kv-stg-shared-rota"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-kv-stg-shared-snl|hmi-kv-stg-shared-snl"
        name                           = "hmi-kv-stg-shared-snl"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 5 to add, 9 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":33,"Program":"tfcmt","SHA1":"","Vars":{}} -->